In [ ]:
import pandas as pd
taxi = pd.read_csv('~/')

In [2]:
#Импорт библиотеки pandas и загрузка данных из файла
import pandas as pd
taxi = pd.read_csv('C:/Users/мой компьютер/Downloads/2_taxi_nyc.csv')

In [3]:
#Обращение к атрибуту shape, чтобы узнать размер таблицы(датафрэйма)
taxi.shape

(29101, 14)

In [4]:
#Атрибут dtypes, чтобы узнать типы колонок в датасете, преобладает тип float64
taxi.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

In [5]:
taxi.head(5)

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [6]:
#Текущие названия колонок
taxi.columns

Index(['pickup_dt', 'pickup_month', 'borough', 'pickups', 'hday', 'spd', 'vsb',
       'temp', 'dewp', 'slp', 'pcp 01', 'pcp 06', 'pcp 24', 'sd'],
      dtype='object')

In [7]:
#Переименование колонок 'pcp 01', 'pcp 06', 'pcp 24'

taxi = taxi.rename(columns = {'pickup_dt': 'pickup_dt', 
                   'pickup_month': 'pickup_month', 
                   'borough': 'borough', 
                   'pickups': 'pickups', 
                   'hday': 'hday', 
                   'spd': 'spd', 
                   'vsb': 'vsb',
                   'temp': 'temp', 
                   'dewp': 'dewp', 
                   'slp': 'slp', 
                   'pcp 01': 'pcp_01', 
                   'pcp 06': 'pcp_06', 
                   'pcp 24': 'pcp_24', 
                   'sd': 'sd'})

In [8]:
#Проверка корректности изменения названий
taxi.head(5)

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [9]:
#Сколько записей(строк) в датафрэйме относится к каждому из районов
taxi.borough.value_counts()

Bronx            4343
Brooklyn         4343
EWR              4343
Manhattan        4343
Queens           4343
Staten Island    4343
Name: borough, dtype: int64

In [10]:
#Суммарное количество заказов такси
taxi.pickups.sum()

14265773

In [17]:
#Сумма заказов такси по районам
taxi.groupby('borough', as_index=False)\
        .agg({'pickups': 'sum'})

         borough   pickups
0          Bronx    220047
1       Brooklyn   2321035
2            EWR       105
3      Manhattan  10367841
4         Queens   1343528
5  Staten Island      6957

In [18]:
#Сумма заказов такси по районам (вызов метода в одну строку)
taxi.groupby('borough').pickups.sum()

borough
Bronx              220047
Brooklyn          2321035
EWR                   105
Manhattan        10367841
Queens            1343528
Staten Island        6957
Name: pickups, dtype: int64

In [22]:
#Район, из которого меньше всего поездок, записываем в переменную min_pickups
min_pickups = taxi.groupby('borough').pickups.sum().idxmin()

'EWR'

In [76]:
#Среднее количество поездок по районам в выходные и рабочие дни
taxi.groupby(['borough', 'hday'])\
        .agg({'pickups': 'mean'})

                        pickups
borough       hday
Bronx         N       50.771073
              Y       48.065868
Brooklyn      N      534.727969
              Y      527.011976
EWR           N        0.023467
              Y        0.041916
Manhattan     N     2401.302921
              Y     2035.928144
Queens        N      308.899904
              Y      320.730539
Staten Island N        1.606082
              Y        1.497006

In [23]:
#Среднее количество поездок по районам в выходные и рабочие дни(в одну строку)
taxi.groupby(['borough', 'hday']).pickups.mean().to_frame()

                        pickups
borough       hday
Bronx         N       50.771073
              Y       48.065868
Brooklyn      N      534.727969
              Y      527.011976
EWR           N        0.023467
              Y        0.041916
Manhattan     N     2401.302921
              Y     2035.928144
Queens        N      308.899904
              Y      320.730539
Staten Island N        1.606082
              Y        1.497006

In [24]:
#Суммарное количество поездок по районам и месяцам, в убывающем порядке по количеству
pickups_by_mon_bor = taxi.groupby(['pickup_month', 'borough'], as_index=False)\
                                    .agg({'pickups': 'sum'})\
                                    .sort_values('pickups', ascending=False)

In [25]:
print(pickups_by_mon_bor)

   pickup_month        borough  pickups
21          Jun      Manhattan  1995388
33          May      Manhattan  1888800
9           Feb      Manhattan  1718571
27          Mar      Manhattan  1661261
3           Apr      Manhattan  1648278
15          Jan      Manhattan  1455543
19          Jun       Brooklyn   482466
31          May       Brooklyn   476087
1           Apr       Brooklyn   378095
25          Mar       Brooklyn   346726
7           Feb       Brooklyn   328650
13          Jan       Brooklyn   309011
22          Jun         Queens   286311
34          May         Queens   275893
28          Mar         Queens   219561
4           Apr         Queens   216857
10          Feb         Queens   185695
16          Jan         Queens   159211
30          May          Bronx    53037
18          Jun          Bronx    49006
0           Apr          Bronx    34617
24          Mar          Bronx    32232
6           Feb          Bronx    28694
12          Jan          Bronx    22461
23          Jun  Staten Island     1673
35          May  Staten Island     1517
5           Apr  Staten Island     1068
29          Mar  Staten Island      975
11          Feb  Staten Island      903
17          Jan  Staten Island      821
20          Jun            EWR       29
32          May            EWR       27
26          Mar            EWR       14
8           Feb            EWR       14
14          Jan            EWR       11
2           Apr            EWR       10

In [77]:
#Проверка размера полученного датасета
pickups_by_mon_bor.shape

(36, 3)

In [80]:
#Данные из колонки темпертур исходного датасета
taxi.temp

0        30.0
1        30.0
2        30.0
3        30.0
4        30.0
         ...
29096    75.0
29097    75.0
29098    75.0
29099    75.0
29100    75.0
Name: temp, Length: 29101, dtype: float64

In [78]:
#Функция перевода градусов Фаренгейта в Цельсия
def temp_to_celcius(series):
    return (series - 32) * 5 / 9

In [79]:
temp_to_celcius(taxi.temp)

0        -1.111111
1        -1.111111
2        -1.111111
3        -1.111111
4        -1.111111
           ...
29096    23.888889
29097    23.888889
29098    23.888889
29099    23.888889
29100    23.888889
Name: temp, Length: 29101, dtype: float64